# KOŞULLU ELEMAN İŞLEMLERİ

In [67]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df

   var1  var2  var3
0     2     8    19
1    17     4    26
2    28     5    15
3    16    16     1
4    17     6    17
5     6    24    16
6    10    26    11
7     4    14    29
8     2     6    23
9    14     8    18

In [68]:
df.var1

0     2
1    17
2    28
3    16
4    17
5     6
6    10
7     4
8     2
9    14
Name: var1, dtype: int32

In [69]:
df[df.var1 > 15]

   var1  var2  var3
1    17     4    26
2    28     5    15
3    16    16     1
4    17     6    17

In [70]:
df[(df.var1 > 15) & (df.var3 < 20)]

   var1  var2  var3
2    28     5    15
3    16    16     1
4    17     6    17